---
kind: method
id: M:Autodesk.Revit.DB.DWFXExportOptions.#ctor
source: html/1060e7bf-cc55-c1db-e6a9-2f9ceb2695c3.htm
---
# Autodesk.Revit.DB.DWFXExportOptions.#ctor Method

Default constructor. Sets all options to their default values.

## Syntax (C#)
```csharp
public DWFXExportOptions()
```